# Apply A Function To Every Item In A Pandas Column

- **Author:** [Chris Albon](http://www.chrisalbon.com/), [@ChrisAlbon](https://twitter.com/chrisalbon)
- **Date:** 22 May 2015
- **Repo:** [Data Science for Political and Social Phenomena](https://github.com/chrisalbon/Data-Science-For-Political-And-Social-Phenomena)
- **Note:**

In [8]:
# Import pandas
import pandas as pd

In [ ]:
# Generate a simulated dataset
raw_data = {'first_name': ['JASON', 'MOLLY', 'TINA', 'JAKE', 'AMY']}
df = pd.DataFrame(raw_data, columns = ['first_name'])
df

  first_name last_name  age  preTestScore  postTestScore
0      Jason    Miller   42             4             25
1      Molly  Jacobson   52            24             94
2       Tina       Ali   36            31             57
3       Jake    Milner   24             2             62
4        Amy     Cooze   73             3             70

In [12]:
def lowercase_names(x):
    x = x.str.lower()
    return x

In [13]:
lowercase_names(df['first_name'])

0    jason
1    molly
2     tina
3     jake
4      amy
Name: first_name, dtype: object

In [5]:
df

  first_name last_name  age  preTestScore  postTestScore
0      Jason    Miller   42             4             25
1      Molly  Jacobson   52            24             94
2       Tina       Ali   36            31             57
3       Jake    Milner   24             2             62
4        Amy     Cooze   73             3             70